<a href="https://colab.research.google.com/github/LIMSONA/Machine_learning_study/blob/main/DataFrame_2.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# **DataFrame 행, 열 선택 및 필터링 복습**

## 복습

In [2]:
import os
import pandas as pd

In [3]:
os.listdir('./drive/MyDrive/파이썬~머신러닝/machine_learning_data')

['friend.csv', 'new_friend.csv', 'abalone.data']

In [4]:
base_src="./drive/MyDrive/파이썬~머신러닝/machine_learning_data"
friend_src= base_src + "/friend.csv"
df=pd.read_csv(friend_src)
df.head()

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager

In [5]:
df.iloc[2]

name       Nate
age          30
job     teacher
Name: 2, dtype: object

In [19]:
df['job']

0      student
1    developer
2      teacher
3      dentist
4      manager
5       intern
Name: job, dtype: object

In [20]:
df.loc[:,'job']

0      student
1    developer
2      teacher
3      dentist
4      manager
5       intern
Name: job, dtype: object

In [22]:
df.iloc[[2,3]] # 슬라이싱 기능 사용(x)

    name  age      job
2   Nate   30  teacher
3  Julia   40  dentist

In [23]:
df.iloc[2:4] # 슬라이싱 기능 사용(ㅇ)

    name  age      job
2   Nate   30  teacher
3  Julia   40  dentist

In [24]:
df.iloc[:3]

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher

In [ ]:
# "많이 하는 질문!"
```iloc VS loc 뭐가 다른거죠 ?????```
- iloc는 인덱스와 컬럼을 리스트 배열로 선택하는 것!
- loc는 인덱스와 컬럼을 문자로 선택하는 것!
- 따라서 상황에 맞게 선택하는 것이 중요!

## 추가 (조건걸기)

In [29]:
# 조건 필터링 걸어서 가져오기
## 30대 이상 가져오기
df['age']>=30 #T/F 형태

0    False
1     True
2     True
3     True
4     True
5    False
Name: age, dtype: bool

In [30]:
#df를 쓰고 데이터프레임df를 쓰는 공식으로 !

df[df['age']>=30]

    name  age        job
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager

In [32]:
## job이 intern인 사람 가져오기
df[df['job']=='intern']

    name  age     job
5  Chris   25  intern

In [33]:
##조건여러개 - and function의 경우 '() & ()'이용
#30대 이상 40대 이하
df[(df['age']>=30) & (df['age']<=40)]

    name  age        job
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist

In [34]:
## 조건 여러개 걸기 (or function) '() | ()'이용
#30대 미만 혹은 40대 초과
df[(df['age']<30)|(df['age']>40)]

    name  age      job
0   John   20  student
4  Brian   45  manager
5  Chris   25   intern

In [36]:
## in을 통한 포함 조건 걸기
4 in [1,2,3,4,5,6] #4는 단일값

True

In [37]:
#학생과 매니저 직업인 사람 구하기
df[df['job']in['student','manager']] #---->단일값이 아닌 시리즈이기떄문에 오류생김

ValueError: ignored

In [38]:
#복잡하게 이렇게 사용은 가능
df[(df['job']=='student')|(df['job']=='manager')]

    name  age      job
0   John   20  student
4  Brian   45  manager

In [45]:
# 포함 필터링을 사용하고 싶다면 추후에 배울 "apply" 함수를 활용하라.
# lambda 함수
# apply ~적용할거다
#lamda x는 행마다 들어있는지 찾는 것
df['job'].apply(lambda x: x in ['student','manager'])

0     True
1    False
2    False
3    False
4     True
5    False
Name: job, dtype: bool

In [46]:
df[df['job'].apply(lambda x: x in ['student','manager'])]

    name  age      job
0   John   20  student
4  Brian   45  manager

# **DataFrame 행, 열 삭제**

In [7]:
import numpy as np
df = pd.DataFrame(np.arange(12).reshape(3, 4),
                  columns=['A', 'B', 'C', 'D']) 

df

   A  B   C   D
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [8]:
# ['B','C'] 컬럼을 삭제하겠다. 
# axis=0 or 1 => 0:row 방향 , 1:col 방향
df.drop(['B', 'C'], axis=1)

   A   D
0  0   3
1  4   7
2  8  11

In [9]:
#inplace=True를 쓰면 자동 저장(변수 설정안해도)

In [12]:
# index 0과 1을 삭제하겠다.
df.drop([0, 1])

   A  B   C   D
2  8  9  10  11

# **DataFrame 행, 열 수정**

In [13]:
df=pd.read_csv(friend_src,encoding='utf-8')
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [16]:
#df 복사하기! 원본 데이터 유지 위해
#실수하는 경우 이전으로 돌아가기 위해
temp=df.copy()

In [17]:
# age 컬럼 모든 값 변경
temp['age']=20
temp

    name  age        job
0   John   20    student
1  Jenny   20  developer
2   Nate   20    teacher
3  Julia   20    dentist
4  Brian   20    manager
5  Chris   20     intern

In [19]:
# 인덱스 2번, 컬럼 age => 15로 바꾸기
temp.loc[2,'age']=15
temp

    name  age        job
0   John   20    student
1  Jenny   20  developer
2   Nate   15    teacher
3  Julia   20    dentist
4  Brian   20    manager
5  Chris   20     intern

# **DataFrame 그룹 생성**

* pandas의 groupby() 연산자를 사용하여 집단, 그룹별로 데이터를 집계 및 요약을 할 수 있다.
* dataframe을 지정한 그룹으로 나누고, 각 그룹별로 집계합수를 적용하고, 그룹별 집계 결과를 하나로 합치는 과정을 거친다.

In [21]:
os.listdir(base_src)

['friend.csv', 'new_friend.csv', 'abalone.data']

In [22]:
abalone_src=base_src+'/abalone.data'

In [25]:
#sep: 분리기준 / names: 칼럼이름

abalone_df = pd.read_csv(abalone_src,header=None,sep=',',
                          names=['sex','length','diameter','height', 
                                       'whole_weight','shucked_weight','viscera_weight', 
                                       'shell_weight','rings'])
abalone_df

     sex  length  diameter  ...  viscera_weight  shell_weight  rings
0      M   0.455     0.365  ...          0.1010        0.1500     15
1      M   0.350     0.265  ...          0.0485        0.0700      7
2      F   0.530     0.420  ...          0.1415        0.2100      9
3      M   0.440     0.365  ...          0.1140        0.1550     10
4      I   0.330     0.255  ...          0.0395        0.0550      7
...   ..     ...       ...  ...             ...           ...    ...
4172   F   0.565     0.450  ...          0.2390        0.2490     11
4173   M   0.590     0.440  ...          0.2145        0.2605     10
4174   M   0.600     0.475  ...          0.2875        0.3080      9
4175   F   0.625     0.485  ...          0.2610        0.2960     10
4176   M   0.710     0.555  ...          0.3765        0.4950     12

[4177 rows x 9 columns]

In [26]:
# df를 받아오면 먼저 데이터 shape 확인한다  

#=> 4177개의 데이터와 9개의 변수
#딥러닝(CNN)-이미지 (데이터수, 가로, 세로, 채널)
#딥러닝(RNN)-텍스트,시계열(데이터수, 시간, 세로)

abalone_df.shape #2D로 표현

(4177, 9)

In [31]:
# 데이터 결측값(비어있는 값null) 확인
abalone_df.isnull().sum()

sex               0
length            0
diameter          0
height            0
whole_weight      0
shucked_weight    0
viscera_weight    0
shell_weight      0
rings             0
dtype: int64

In [34]:
abalone_df.isnull().sum(axis=0)

sex               0
length            0
diameter          0
height            0
whole_weight      0
shucked_weight    0
viscera_weight    0
shell_weight      0
rings             0
dtype: int64

In [29]:
abalone_df.isnull().sum().sum() 
#결측값Null이 없는 경우 0, 결측값이 있는 경우 True=1값들이 모여서 나타냄

#null 값은 None랑 N/A랑 ''도 null값이다.

0

In [35]:
#기술통계 확인-> 연속형 변수만 확인 가능. 즉 numercal 변수만 확인 가능함
#그래서 성별sex 열의 경우에는 보이지 않음
#(행 - 집계, 평균, 편차, 최소값, 25%, 50%, 75%, 최대값)
abalone_df.describe()

            length     diameter  ...  shell_weight        rings
count  4177.000000  4177.000000  ...   4177.000000  4177.000000
mean      0.523992     0.407881  ...      0.238831     9.933684
std       0.120093     0.099240  ...      0.139203     3.224169
min       0.075000     0.055000  ...      0.001500     1.000000
25%       0.450000     0.350000  ...      0.130000     8.000000
50%       0.545000     0.425000  ...      0.234000     9.000000
75%       0.615000     0.480000  ...      0.329000    11.000000
max       0.815000     0.650000  ...      1.005000    29.000000

[8 rows x 8 columns]

In [39]:
# 전복 성별(M,F,I)에 따라 groupby함수를 통해 집계
#         DataFrame [집계 변수].groupby(DataFrame[집계 대상])
grouped= abalone_df['whole_weight'].groupby(abalone_df['sex'])

* 그룹별 합계 : grouped.sum()
* 그룹별 평균 : grouped.mean()
* 그룹별 크기(개수) : grouped.size()

In [41]:
grouped.sum()

sex
F    1367.8175
I     578.8885
M    1514.9500
Name: whole_weight, dtype: float64

In [42]:
grouped.mean()  #이상 치인것

sex
F    1.046532
I    0.431363
M    0.991459
Name: whole_weight, dtype: float64

In [43]:
grouped.size() #몇 개인지

sex
F    1307
I    1342
M    1528
Name: whole_weight, dtype: int64

In [44]:
#그룹변수 하나가 아닌, 전체 연속형 변수에 대한 집계
#집계대상인 컬럼만 작성하면 됨
#         .groupby(DataFrame[집계 대상])
abalone_df.groupby(abalone_df['sex']).mean()

       length  diameter    height  ...  viscera_weight  shell_weight      rings
sex                                ...
F    0.579093  0.454732  0.158011  ...        0.230689      0.302010  11.129304
I    0.427746  0.326494  0.107996  ...        0.092010      0.128182   7.890462
M    0.561391  0.439287  0.151381  ...        0.215545      0.281969  10.705497

[3 rows x 8 columns]

In [45]:
#위와 동일한 간단 표현 방법
abalone_df.groupby('sex').mean()

       length  diameter    height  ...  viscera_weight  shell_weight      rings
sex                                ...
F    0.579093  0.454732  0.158011  ...        0.230689      0.302010  11.129304
I    0.427746  0.326494  0.107996  ...        0.092010      0.128182   7.890462
M    0.561391  0.439287  0.151381  ...        0.215545      0.281969  10.705497

[3 rows x 8 columns]

In [49]:
#새로운 조건에 맞는 변수 추가하기
abalone_df['length_bool'] = np.where(abalone_df['length']>abalone_df['length'].median(),#median 중간값
  				'length_long', # True일 경우
  				'length_short') # False일 경우
abalone_df

     sex  length  diameter  ...  shell_weight  rings   length_bool
0      M   0.455     0.365  ...        0.1500     15  length_short
1      M   0.350     0.265  ...        0.0700      7  length_short
2      F   0.530     0.420  ...        0.2100      9  length_short
3      M   0.440     0.365  ...        0.1550     10  length_short
4      I   0.330     0.255  ...        0.0550      7  length_short
...   ..     ...       ...  ...           ...    ...           ...
4172   F   0.565     0.450  ...        0.2490     11   length_long
4173   M   0.590     0.440  ...        0.2605     10   length_long
4174   M   0.600     0.475  ...        0.3080      9   length_long
4175   F   0.625     0.485  ...        0.2960     10   length_long
4176   M   0.710     0.555  ...        0.4950     12   length_long

[4177 rows x 10 columns]

In [50]:
# 그룹변수를 2개 이상 선택하여 총계처리
abalone_df.groupby(['sex','length_bool']).mean()  # EDA

                    length  diameter  ...  shell_weight      rings
sex length_bool                       ...
F   length_long   0.626895  0.493020  ...      0.360013  11.415073
    length_short  0.477428  0.373301  ...      0.178650  10.521531
I   length_long   0.584495  0.452952  ...      0.273247  10.585106
    length_short  0.402210  0.305893  ...      0.104549   7.451473
M   length_long   0.623359  0.489291  ...      0.351683  11.299172
    length_short  0.454875  0.353336  ...      0.162141   9.685053

[6 rows x 8 columns]

In [51]:
abalone_df.groupby(['sex','length_bool'])['whole_weight'].mean()

sex  length_bool
F    length_long     1.261330
     length_short    0.589702
I    length_long     0.923215
     length_short    0.351234
M    length_long     1.255182
     length_short    0.538157
Name: whole_weight, dtype: float64

#**중복 데이터 삭제**

<실행 순서>
1.   중복 데이터 삭제 결측치
2.   중복된 데이터 확인

In [53]:
# 중복된 row를 확인하는 법
abalone_df.duplicated()

0       False
1       False
2       False
3       False
4       False
        ...
4172    False
4173    False
4174    False
4175    False
4176    False
Length: 4177, dtype: bool

In [54]:
abalone_df.duplicated().sum()  #너무 많은 데이터때문에 다 안보인 sum()을 통해 확인한다.

0

In [ ]:
# 중복 예제 생성을 위해서, 가상으로 중복데이터 생성해보기
## pd.concat은 2개의 DataFrame을 합치는 함수이다.

In [59]:
new_abalone=abalone_df.iloc[[0]]
new_abalone

  sex  length  diameter  ...  shell_weight  rings   length_bool
0   M   0.455     0.365  ...          0.15     15  length_short

[1 rows x 10 columns]

In [62]:
new_abalone_df = pd.concat([abalone_df,new_abalone],axis=0) #맨 밑에 행에 합쳐짐
new_abalone_df

     sex  length  diameter  ...  shell_weight  rings   length_bool
0      M   0.455     0.365  ...        0.1500     15  length_short
1      M   0.350     0.265  ...        0.0700      7  length_short
2      F   0.530     0.420  ...        0.2100      9  length_short
3      M   0.440     0.365  ...        0.1550     10  length_short
4      I   0.330     0.255  ...        0.0550      7  length_short
...   ..     ...       ...  ...           ...    ...           ...
4173   M   0.590     0.440  ...        0.2605     10   length_long
4174   M   0.600     0.475  ...        0.3080      9   length_long
4175   F   0.625     0.485  ...        0.2960     10   length_long
4176   M   0.710     0.555  ...        0.4950     12   length_long
0      M   0.455     0.365  ...        0.1500     15  length_short

[4178 rows x 10 columns]

In [67]:
new_abalone_df.duplicated() #w중복된 값 조회

0       False
1       False
2       False
3       False
4       False
        ...
4173    False
4174    False
4175    False
4176    False
0        True
Length: 4178, dtype: bool

In [64]:
# keep='last' 옵션을 통해서 처음으로 중복되는 데이터를 검색
new_abalone_df.duplicated(keep='last')

0        True
1       False
2       False
3       False
4       False
        ...
4173    False
4174    False
4175    False
4176    False
0       False
Length: 4178, dtype: bool

In [65]:
#중복데이터 row 삭제( .drop_duplicates( ) )
new_abalone_df.drop_duplicates()

     sex  length  diameter  ...  shell_weight  rings   length_bool
0      M   0.455     0.365  ...        0.1500     15  length_short
1      M   0.350     0.265  ...        0.0700      7  length_short
2      F   0.530     0.420  ...        0.2100      9  length_short
3      M   0.440     0.365  ...        0.1550     10  length_short
4      I   0.330     0.255  ...        0.0550      7  length_short
...   ..     ...       ...  ...           ...    ...           ...
4172   F   0.565     0.450  ...        0.2490     11   length_long
4173   M   0.590     0.440  ...        0.2605     10   length_long
4174   M   0.600     0.475  ...        0.3080      9   length_long
4175   F   0.625     0.485  ...        0.2960     10   length_long
4176   M   0.710     0.555  ...        0.4950     12   length_long

[4177 rows x 10 columns]

In [68]:
# 중복 데이터(row) 삭제(첫번째 중복되는 것)
new_abalone_df.drop_duplicates(keep='last')

     sex  length  diameter  ...  shell_weight  rings   length_bool
1      M   0.350     0.265  ...        0.0700      7  length_short
2      F   0.530     0.420  ...        0.2100      9  length_short
3      M   0.440     0.365  ...        0.1550     10  length_short
4      I   0.330     0.255  ...        0.0550      7  length_short
5      I   0.425     0.300  ...        0.1200      8  length_short
...   ..     ...       ...  ...           ...    ...           ...
4173   M   0.590     0.440  ...        0.2605     10   length_long
4174   M   0.600     0.475  ...        0.3080      9   length_long
4175   F   0.625     0.485  ...        0.2960     10   length_long
4176   M   0.710     0.555  ...        0.4950     12   length_long
0      M   0.455     0.365  ...        0.1500     15  length_short

[4177 rows x 10 columns]

#**NaN(결측치) 찾아서 다른 값 변경**

In [26]:
import os
import pandas as pd
import numpy as np
os.listdir('./drive/MyDrive/파이썬~머신러닝/machine_learning_data')

['friend.csv', 'new_friend.csv', 'abalone.data']

In [8]:
base_src='./drive/MyDrive/파이썬~머신러닝/machine_learning_data'

In [11]:
abalone_src = base_src+'/abalone.data'

In [15]:
abalone_df = pd.read_csv(abalone_src,header=None,sep=',',
                          names=['sex','length','diameter','height', 
                                       'whole_weight','shucked_weight','viscera_weight', 
                                       'shell_weight','rings'])
abalone_df

     sex  length  diameter  ...  viscera_weight  shell_weight  rings
0      M   0.455     0.365  ...          0.1010        0.1500     15
1      M   0.350     0.265  ...          0.0485        0.0700      7
2      F   0.530     0.420  ...          0.1415        0.2100      9
3      M   0.440     0.365  ...          0.1140        0.1550     10
4      I   0.330     0.255  ...          0.0395        0.0550      7
...   ..     ...       ...  ...             ...           ...    ...
4172   F   0.565     0.450  ...          0.2390        0.2490     11
4173   M   0.590     0.440  ...          0.2145        0.2605     10
4174   M   0.600     0.475  ...          0.2875        0.3080      9
4175   F   0.625     0.485  ...          0.2610        0.2960     10
4176   M   0.710     0.555  ...          0.3765        0.4950     12

[4177 rows x 9 columns]

In [16]:
# NaN(결측치) 찾아서 다른 값 변경하도록 만들어보기
abalone_df.isnull().sum().sum()

0

In [23]:
nan_abalone_df=abalone_df.copy()

In [28]:
nan_abalone_df.loc[2,'length'] = np.nan
#np에서 제공하는 nan를 이용

In [35]:
nan_abalone_df.isnull().sum().sum()

1

* 결측치를 특정값으로 채우기 .fillna( )

In [36]:
#결측치를 특정값으로 채우기 .fillna()
zero_abalone_df=nan_abalone_df.fillna(0)
zero_abalone_df

     sex  length  diameter  ...  viscera_weight  shell_weight  rings
0      M   0.455     0.365  ...          0.1010        0.1500     15
1      M   0.350     0.265  ...          0.0485        0.0700      7
2      F   0.000     0.420  ...          0.1415        0.2100      9
3      M   0.440     0.365  ...          0.1140        0.1550     10
4      I   0.330     0.255  ...          0.0395        0.0550      7
...   ..     ...       ...  ...             ...           ...    ...
4172   F   0.565     0.450  ...          0.2390        0.2490     11
4173   M   0.590     0.440  ...          0.2145        0.2605     10
4174   M   0.600     0.475  ...          0.2875        0.3080      9
4175   F   0.625     0.485  ...          0.2610        0.2960     10
4176   M   0.710     0.555  ...          0.3765        0.4950     12

[4177 rows x 9 columns]

* 결측치를 결측치가 속한 컬럼의 평균값으로 대체하기 평균으로 채우기
fillna(데이터프레임.mean())

In [37]:
# 결측치를 결측치가 속한 컬럼의 평균값으로 대체하기
# 성별같은 비연속값의 경우 평균을 넣지 않고 그대로 NaN으로 남아있음
nan_abalone_df.mean())

length            0.523991
diameter          0.407881
height            0.139516
whole_weight      0.828742
shucked_weight    0.359367
viscera_weight    0.180594
shell_weight      0.238831
rings             9.933684
dtype: float64

In [39]:
nan_abalone_df.fillna(nan_abalone_df.mean())

     sex    length  diameter  ...  viscera_weight  shell_weight  rings
0      M  0.455000     0.365  ...          0.1010        0.1500     15
1      M  0.350000     0.265  ...          0.0485        0.0700      7
2      F  0.523991     0.420  ...          0.1415        0.2100      9
3      M  0.440000     0.365  ...          0.1140        0.1550     10
4      I  0.330000     0.255  ...          0.0395        0.0550      7
...   ..       ...       ...  ...             ...           ...    ...
4172   F  0.565000     0.450  ...          0.2390        0.2490     11
4173   M  0.590000     0.440  ...          0.2145        0.2605     10
4174   M  0.600000     0.475  ...          0.2875        0.3080      9
4175   F  0.625000     0.485  ...          0.2610        0.2960     10
4176   M  0.710000     0.555  ...          0.3765        0.4950     12

[4177 rows x 9 columns]

In [41]:
nan_abalone_df['length'].fillna(nan_abalone_df.mean())

0       0.455
1       0.350
2         NaN
3       0.440
4       0.330
        ...
4172    0.565
4173    0.590
4174    0.600
4175    0.625
4176    0.710
Name: length, Length: 4177, dtype: float64

In [44]:
## 비연속 값인 sex의 경우 결측값을 어떻게 넣을까..?
# 1) 먼저 Nan값 넣어주기
nan_abalone_df.loc[2,'sex']=np.nan

In [47]:
sex_mode=nan_abalone_df['sex'].value_counts().sort_values(ascending=False).index[0]

In [48]:
sex_mode

'M'

In [46]:
nan_abalone_df['sex'].fillna(sex_mode)

0       M
1       M
2       M
3       M
4       I
       ..
4172    F
4173    M
4174    M
4175    F
4176    M
Name: sex, Length: 4177, dtype: object

# **apply 함수 활용**

*DataFrame타입의 객체에서 호출가능한 apply함수에 대해 살펴보자.

*본인이 원하는 행과 열에 연산 혹은 function을 적용할 수 있다.

*열 기준으로 집계하고 싶은 경우 axis=0

*행 기준으로 집계하고 싶은 경우 axis=1

In [56]:
abalone_df[['diameter']].mean()

diameter    0.407881
dtype: float64

In [51]:
#열기준 집계
abalone_df[['diameter']].apply(np.average,axis=0)

diameter    0.407881
dtype: float64

In [57]:
#행기준 집계
abalone_df[['diameter']].apply(np.average,axis=1)

0       0.365
1       0.265
2       0.420
3       0.365
4       0.255
        ...
4172    0.450
4173    0.440
4174    0.475
4175    0.485
4176    0.555
Length: 4177, dtype: float64

**사용자 함수를 통한 집계!!! 중요**
* def( )함수 이용

In [63]:
import math
def avg_ceil(x,y,z):
  return math.ceil((x+y+z)/3) 

#lambda함수에서 x는 하나의 행을 의미
abalone_df[['diameter','height','whole_weight']].apply(lambda x: avg_ceil( ),axis=1)

0       1
1       1
2       1
3       1
4       1
       ..
4172    1
4173    1
4174    1
4175    1
4176    1
Length: 4177, dtype: int64


* 문제 
  1. 사용자 정의 함수 사용
  2. ['diameter','height','whole_weight'] 변수 사용
  3. 세 변수의 합이 1이 넘으면 True, 아니면 False 출력 후 answer변수에 저장
  4. abalone_df에 answer 열을 추가하고 입력

In [ ]:
# 실패
# def sona(x,y,z):
#    answer=0
#    if (x+y+z)>1: return True
#    else: 
#     return False
#     answer=x+y+z

# abalone_df[['diameter','height','whole_weight']].apply(lambda x: sona(x[0],x[1],x[2]),axis=1)

In [71]:
#정답
def f(x):
  sum_=x[0]+x[1]+x[2]
  if sum_>1:
    return True
  else:
    return False

answer= abalone_df[['diameter','height','whole_weight']].apply(lambda x: f(x),axis=1)
abalone_df['answer'] = answer

In [72]:
abalone_df

     sex  length  diameter  height  ...  viscera_weight  shell_weight  rings  answer
0      M   0.455     0.365   0.095  ...          0.1010        0.1500     15   False
1      M   0.350     0.265   0.090  ...          0.0485        0.0700      7   False
2      F   0.530     0.420   0.135  ...          0.1415        0.2100      9    True
3      M   0.440     0.365   0.125  ...          0.1140        0.1550     10    True
4      I   0.330     0.255   0.080  ...          0.0395        0.0550      7   False
...   ..     ...       ...     ...  ...             ...           ...    ...     ...
4172   F   0.565     0.450   0.165  ...          0.2390        0.2490     11    True
4173   M   0.590     0.440   0.135  ...          0.2145        0.2605     10    True
4174   M   0.600     0.475   0.205  ...          0.2875        0.3080      9    True
4175   F   0.625     0.485   0.150  ...          0.2610        0.2960     10    True
4176   M   0.710     0.555   0.195  ...          0.3765        0.4950     12    True

[4177 rows x 10 columns]

# **컬럼 내 유니크한 값 뽑아서 갯수 확인**

* 카테고리 변수에서 사용가능
.value_counts()

abalone_df['sex'].value_counts()

In [73]:
#cnt와 내림차순
abalone_df['sex'].value_counts(ascending=True)

F    1307
I    1342
M    1528
Name: sex, dtype: int64

In [74]:
#cnt와 결측값이 있는 경우
abalone_df['sex'].value_counts(dropna=True)

M    1528
I    1342
F    1307
Name: sex, dtype: int64

# **두 개의 DataFrame 합치기**

* pd.concat([ A , B ]) DF A와 DF B와 합칠 때

In [77]:
# 가상 abalone 1개 row데이터 생성 및 결합
#axis=0으로 써주기
one_abalone_df = abalone_df.iloc[[0]]
pd.concat([abalone_df,one_abalone_df],axis=0)

     sex  length  diameter  height  ...  viscera_weight  shell_weight  rings  answer
0      M   0.455     0.365   0.095  ...          0.1010        0.1500     15   False
1      M   0.350     0.265   0.090  ...          0.0485        0.0700      7   False
2      F   0.530     0.420   0.135  ...          0.1415        0.2100      9    True
3      M   0.440     0.365   0.125  ...          0.1140        0.1550     10    True
4      I   0.330     0.255   0.080  ...          0.0395        0.0550      7   False
...   ..     ...       ...     ...  ...             ...           ...    ...     ...
4173   M   0.590     0.440   0.135  ...          0.2145        0.2605     10    True
4174   M   0.600     0.475   0.205  ...          0.2875        0.3080      9    True
4175   F   0.625     0.485   0.150  ...          0.2610        0.2960     10    True
4176   M   0.710     0.555   0.195  ...          0.3765        0.4950     12    True
0      M   0.455     0.365   0.095  ...          0.1010        0.1500     15   False

[4178 rows x 10 columns]

In [78]:
# 가상 abalone 1개 column 데이터 생성 및 결합
#axis=1로 써주기
one_abalone_df = abalone_df.iloc[:,[0]]
pd.concat([abalone_df,one_abalone_df],axis=1)

      sex  length  diameter  height  ...  shell_weight  rings  answer  sex
0       M   0.455     0.365   0.095  ...        0.1500     15   False    M
1       M   0.350     0.265   0.090  ...        0.0700      7   False    M
2       F   0.530     0.420   0.135  ...        0.2100      9    True    F
3       M   0.440     0.365   0.125  ...        0.1550     10    True    M
4       I   0.330     0.255   0.080  ...        0.0550      7   False    I
...   ...     ...       ...     ...  ...           ...    ...     ...  ...
4172    F   0.565     0.450   0.165  ...        0.2490     11    True    F
4173    M   0.590     0.440   0.135  ...        0.2605     10    True    M
4174    M   0.600     0.475   0.205  ...        0.3080      9    True    M
4175    F   0.625     0.485   0.150  ...        0.2960     10    True    F
4176    M   0.710     0.555   0.195  ...        0.4950     12    True    M

[4177 rows x 11 columns]